/*********************************
FindReplaceEx.js - ver. 2013-02-06
Interface language
Language:      ChineseSimplified (2052)
Translated by: cnnnc
**********************************/
sTxtFRTempl     = '查找/替换 模板';
sTxtTemplates   = '模板';
sTxtName        = '名称';
sTxtFindWhat    = '查找';
sTxtReplaceWith = '替换';
sTxtMatchCase   = '区分大小写';
sTxtWholeWord   = '整字匹配';
sTxtRegExp      = '正则表达式';
sTxtEscSeq      = '转义符序列';
sTxt1Yes0No     = '(1 = 是, 0 = 否)';
sTxtNew         = '新建';
sTxtAdd         = '添加';
sTxtEdit        = '编辑';
sTxtDelete      = '删除';
sTxtOK          = '确定';
sTxtClose       = '关闭';
sTxtNameExists  = '名称已经存在。';
sTxtNoName      = '需要名称。';
sTxtNoFindWhat  = '“查找”内容不能为空。';
sTxtWantRemove  = '是否想要删除?';
sHlpSpecChars   = '()[]{}^$.?+*|\\ 特殊符号';
sHlpFF          = '换页符 \\x0C';
sHlpAnyNL       = '任何换行符';
sHlpTab         = '制表符 \\x09';
sHlpVTab        = '垂直制表符 \\x0B';
sHlpCharHex     = '字符 16 进制编码 FF';
sHlpUniCharHex  = 'Unicode 字符 16 进制编码 FFFF';
sHlpAnyChar     = '任意单一字符';
sHlpDigit       = '数字 [0-9]';
sHlpNonDigit    = '非数字 [^0-9]';
sHlpWhiteSp     = '空白字符 [ \\f\\n\\r\\t\\v]';
sHlpNonWhiteSp  = '非空白字符';
sHlpWordChar    = '单词字符 [A-Za-z0-9_]';
sHlpNonWordChar = '非单词字符';
sHlpBeginLine   = '行开头';
sHlpEndLine     = '行末尾';
sHlpWordBoun    = '单词边界';
sHlpNonWordBoun = '非单词边界';
sHlpAlternative = '匹配 ab 或 xy';
sHlpCharSet     = '字符集合, 匹配所包含的任意一个字符';
sHlpNegCharSet  = '负值字符集合，匹配未包含的任意字符';
sHlpRange       = '匹配 a 到 z 范围内的任意小写字母字符';
sHlpNegRange    = '匹配任何不在 a 到 z 范围内的任意字符';
sHlpCapture     = '匹配 ab 并获取这一匹配';
sHlpNotCapture  = '匹配 ab 但不获取匹配';
sHlpFollow      = '在任何匹配 ab 的字符串开始处匹配查找字符串';
sHlpNotFollow   = '在任何不匹配 ab 的字符串开始处匹配查找字符串';
sHlpBackrefer9  = '向后引用, 范围 1-9';
sHlpBackrefer99 = '向后引用, 范围 01-99';
sHlpZeroOrOne   = '匹配前面的子表达式零次或一次';
sHlpZeroOrMore  = '匹配前面的子表达式零次或多次';
sHlpOneOrMore   = '匹配前面的子表达式一次或多次';
sHlpexactly     = '精确匹配 3 次';
sHlpAtLeast     = '最少匹配 3 次';
sHlpFromTo      = '匹配 3 到 7 次的';
sHlpBackslash   = '反斜线';
sHlpNL          = '换行符';
sHlpEntireStr   = '匹配整个字符串';
sHlpSubmatch9   = '第 9 个捕捉子匹配, 范围 1-9';
sHlpSubmatch99  = '第 99 个捕捉子匹配, 范围 01-99';
sHlpNonGreedy   = '限定符 *+{} 非贪婪模式';